// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "送给我",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "亲爱的谭宝",  // 同上...
        "这回是我第五次给你庆生呢",
        "其实给喜欢的人庆生真的很幸福捏",
        "高三的时候，我总不承认自己还喜欢你",
        "每次都暗示自己我只是喜欢准备惊喜",
        "但也是只有每次你的生日",
        "才让我无比期待",
        "我期待着你收到礼物时候的惊喜",
        "期待看到你因为我开心的样子",
        "既希望你能感受到我的心意",
        "又希望你不要猜到我的心思",
        "一晃我们都21啦",
        "希望我还没有江郎才尽",
        "还能博君一笑",
        "Happy Birthday~~",
        "--By your lovely Xinyi",
        "The end",
        "。",
        "。。",
        "。。。",
        "还没走呢",
        "看啥呢",
        "诶别走哇",
        "小可爱突然出现",
         "（笑）",
        "经典皮肤1",
        "经典皮肤2",
         "扶腰",
         "舒服",
         "嘿嘿",
         "笑到模糊",
         "这回真没了",
         "生日快乐我的宝",
         "love you ❤",
        
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        
        "--By your lovely Xinyi": "./imgs/yee.png",
        "小可爱突然出现": "./imgs/kawayi.jpg",
        "（笑）": "./imgs/smile.jpg",
        "经典皮肤1": "./imgs/classic1.jpg",
        "经典皮肤2": "./imgs/classic2.jpg",
        "扶腰": "./imgs/waist.jpg",
        "舒服": "./imgs/cozy.jpg",
        "嘿嘿": "./imgs/heihei.jpg",
        "笑到模糊": "./imgs/hazy.jpg",
        "love you ❤": "./imgs/love you.jpg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "开始捏",
        play: "戳我",
        bannar_coming: "太好听了8",
        balloons_flying: "简直就是",
        cake_fadein: "天籁",
        light_candle: "21岁啦，许个愿吧",
        wish_message: "嘿嘿",
        story: "还有更麻的",
    },
};
